#Вывести на экран числа от -N до N
a = int(input(('Введите первое число диапазона: ')))
b = int(input(('Введите второе число диапазона: ')))
nums = list(range(a, b+1)) 
print(nums)  